<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1cae3d1706b45f5da3ea7598ba157430591702cb8c3add3d8b4498ca55efe174","plan_job_ref":"Job Terraform plan #40 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8133100778","plan_out_hash":"6d832a408b86fbd730ae2d4a8503a499a85d6f7ea1a8cb22d64e52412f2f2406","plan_hash":"5b3d53b033e8d8cae36781ce1a1f6ac6da2d46f474396c26cbd08b63e0897a43","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
folder_id           = "b1gs3v5tpo5eo8em8ph4"
```
</details>
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                 = "d4ef136o48bqjg3sv4q7"
        name               = "receive-video-handler"
        tags               = []
!~      user_hash          = "cbee80553b2a77db82b49032700a1bc304aa512628ebfaaf919f1991bc0ca6ff" -> "ecbc984dba0fa3b5221713beb0e09bf6016e63a8e724f0a987eb864e81a291cb"
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_function_trigger.receive-video-handler-trigger will be created
+   resource "yandex_function_trigger" "receive-video-handler-trigger" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "receive-video-handler-trigger"

+       function {
+           id                 = "d4ef136o48bqjg3sv4q7"
+           service_account_id = "********************"
        }

+       message_queue {
+           batch_cutoff       = "0"
+           batch_size         = "1"
+           queue_id           = "***********************************************************************"
+           service_account_id = "********************"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #24](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8133101045)